netify-soap/src/test/resources/soap/requests/genre/GetGenreByIdRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetGenreByIdRequest>
            <gen:id>53</gen:id>
        </gen:GetGenreByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>